Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Meow Rangers.tmx
Source language: ko_kr
Languages: en_us

source: 차 로 10분
en_us: 10 MINUTES BY CAR

source: 그냥 네 놈 통째로 쥐어짜버려도 되거든?
en_us: ...WITHOUT EVEN BREAKING A SWEAT.

source: 결합 완료-.
en_us: FUSION COMPLETE.

source: 겨우 이런 게 두려워서 목숨을 버려가면서 싸워왔던 거야?
en_us: IS THIS WHAT THEY WERE SO FRIGHTENED OF THAT THEY LOST THEIR LIVES FIGHTING AGAINST IT?

source: 캣닢 좀 갖고 있나 본데.
en_us: HE’S GOT SOME CATNIP.

source: 부 웅
en_us: SWING

source: 미치도록 마음에 안들어..!!
en_us: THIS IS DRIVING ME NUTS...!!

source: 팟
en_us: WHISH

source: 긁 긁
en_us: SCRATCH SCRATCH

source: 끼오요오옷-!!
en_us: GYAAAAA!!

source: 두 둥
en_us: DUN DUN

source: 너는 방금 나타난 녀석을 맡아!
en_us: YOU TAKE THE ONE THAT JUST GOT HERE!

source: 저는 며칠 전 입원한 냥잉 일뿐입니다.
en_us: I WAS JUST HOSPITALIZED A FEW DAYS AGO.

source: 하아
en_us: HUFF

source: 네로님?
en_us: MASTER NERO?

source: 소란 일으킬 생각 없다.
en_us: THERE’S NO NEED FOR FUSS.

source: 냥인이 세상을 지배하는 거 말이야!
en_us: CAT PEOPLE RULE THE WORLD NOW!

source: 안개를 만들 무언가를 찾아야해!!
en_us: I’VE GOTTA FIND SOMETHING TO MAKE SMOKE!!

source: 박사.
en_us: DOC.

source: 뺏길 바엔 내게 넘겨.
en_us: GIVE IT TO ME BEFORE SHE TAKES IT.

source: 쿠{j}웅
en_us: BAM{j}

source: 죽이 되는 밥이 되든...
en_us: ...I’LL FIGHT TO THE END...

source: 다 덤벼!!
en_us: BRING IT ON!!

source: 네 자신도.
en_us: ...FORGIVE YOURSELF.

source: 콰 아
en_us: BZZZ

source: 난 아직 네놈을 용서하지 않았다고...!!
en_us: I HAVEN’T FORGIVEN YOU BASTARDS...!!

source: 정신 차려!
en_us: WAKE UP!

source: 도망쳐야 돼!!
en_us: WE’VE GOTTA GET OUT OF HERE!!

source: 냐아아아옹-!
en_us: MEOOOW!

source: 울컥
en_us: CHOKE

source: 으으읏-!!
en_us: AAAH!!

source: 냥잼을 몸에 이식해 냥잼 그 자체가 되어 거부 반응을 없애는 방법이 있죠.
en_us: OR ONE COULD GET RID OF SUCH ADVERSE REACTIONS BY TRANSPLANTING THE MEOW GEM ONTO THE BODY.

source: 너는 이제 나를 볼 수도...
en_us: NOW YOU CAN NEITHER SEE ME...

source: 씨익
en_us: SMIRK

source: 우리가 도와주지.
en_us: WE’LL HELP YOU.

source: 쥐ㅅㄲ답게 잘 피하는 군!
en_us: DODGING MY PUNCHES LIKE A RAT, I SEE!

source: 무...{j}문 잠갔을 텐데...!?
en_us: I-I THOUGHT I... LOCKED THE DOOR.

source: 컥...!
en_us: AGH...!

source: 철 컥
en_us: KACHUNK

source: 비상 대피 안내도
en_us: EMERGENCY EVACUATION GUIDE

source: 집사레인저...
en_us: YOU KNOW ABOUT...

source: 실험체 J-94인가...
en_us: SUBJECT J-94...?

source: 맙소사...!
en_us: HOLY SMOKES...!

source: 아등
en_us: WRIGGLE

source: 쿠
en_us: BOOM

source: 궁구구
en_us: WHAM THUMP THWACK

source: 지구 탐사 부대 함장이었던 제가
en_us: AS THE FORMER CAPTAIN OF THIS EXPLORATORY SHIP...

source: 이 녀석은...?
en_us: WHO IS HE..?

source: 냥행성인들에게 그들은 그저 원시인, 무법자.
en_us: IN THE EYES OF CAT PLANET, THEY’VE BECOME LAWLESS AND PRIMITIVE.

source: 저게 뭐야?
en_us: IN THE SKY?

source: 어딨어?
en_us: EVERYONE?

source: 붕 붕 붕
en_us: WHIFF WHIFF WHIFF

source: 대략...
en_us: YOU’VE BEEN OUT FOR...

source: 오지마라.
en_us: STAY BACK.

source: 누...{j}누구세요...!?
en_us: WH-WHO ARE YOU...?!{j}

source: 네로.
en_us: NERO.

source: 내가 알던 집사레인저는...
en_us: THE MEOW RANGERS I KNEW...

source: 두근
en_us: THUMP

source: 어이!!
en_us: HEY!!

source: 죽게 놔두지 않을 겁ㄴ디ㅏ.
en_us: THEY WON’T LET YOU DIE.

source: 이잇-!!
en_us: HIYAAA!!

source: 난 그저...
en_us: I JUST...

source: 덤벼 봤자 금방 당하고 말 거야!
en_us: WILL GET SLAUGHTERED THE MOMENT I TRY TO FIGHT!

source: 퍼억
en_us: WHAM

source: 집사 레인저
en_us: MEOW RANGERS

source: 몸이...
en_us: MY BODY...

source: 넵...!
en_us: YEAH...!

source: 녀석들의 말이 사실이라면...
en_us: IF WHAT THEY’RE SAYING IS TRUE...

source: 그르릉...
en_us: SIGH

source: 문 잠갔을 텐데...!?
en_us: ISN’T THAT THE DOOR BELL...?!

source: - 어쩔 수 없는 냥인 -
en_us: - TRUE CAT PEOPLE -

source: 뭐!?
en_us: WHAT?!

source: 도망치는게 아니야!!
en_us: I’M NOT RUNNING AWAY!!

source: 민식이...
en_us: MINSIK...

source: 타앗
en_us: PLOP

source: 나는...!!
en_us: I’M...!!

source: 콰
en_us: SMASH

source: 신인류는 완성됐다.
en_us: THE NEOHUMAN IS COMPLETE.

source: 손을 잡자.
en_us: LET’S JOIN FORCES...

source: 제냐는 괜찮아!?
en_us: ARE YOU OKAY XENIA?!

source: ㅋㅋ
en_us: HEHE

source: 오빠 패는 동생!!
en_us: BROTHER HITTER!!

source: 이...
en_us: YOU...

source: 흔들
en_us: SHAKE

source: 치와.
en_us: CHIWA.

source: 니들 다친다.
en_us: YOU’RE GONNA GET HURT.

source: 냥인에게 해를 입히면 크게 처벌받는다던데.
en_us: I HEARD IF YOU HARM A CAT PERSON, YOU GET SEVERELY PUNISHED.

source: 뾰로롱
en_us: WHOOSH

source: 냥잼과 결합.
en_us: FUSING WITH MEOW GEM.

source: 내가 마무리 할테니까...
en_us: I’LL FINISH UP HERE...

source: 왜 이래!!
en_us: WHAT HAPPENED TO YOU?!

source: 야.
en_us: HEY.

source: 말도 안돼...
en_us: THERE’S NO WAY...

source: 단단한 근육 때문에 데미지를 입힐 수가...!
en_us: HE’S SO MUSCULAR I WON’T BE ABLE TO DAMAGE HIM...!

source: 털썩
en_us: THUD

source: 쳐 보라고!
en_us: I SAID PUNCH ME!

source: 어이..!!
en_us: HEY...!!

source: 궁지에 몰린 쥐는 고양이를 물려고 한다더니.
en_us: SO THE CORNERED RAT BITES BACK AT THE CAT.

source: 스스슥
en_us: FADE

source: 위{j}이{j}잉
en_us: WHIRL{j}{j}

source: 부글
en_us: BUBBLE

source: 응?
en_us: HUH?

source: 싹둑
en_us: SNIP

source: 쿠구 궁
en_us: RUMBLE

source: 자.
en_us: HERE.

source: 웅성
en_us: WHISPER

source: 문 열라고.
en_us: OPEN THE DOOR.

source: 커헉-!!!
en_us: GYAAA!!

source: 당신들은...!?
en_us: ...ARE YOU PEOPLE...?!

source: 오빠!!!
en_us: HYEONMIN!!!

source: 그때...?
en_us: WAS IT THEN...?

source: 나로 인해 생긴 그림자!!
en_us: ...MY OWN SHADOW?!

source: 내가 지키긴 뭘 지켜...
en_us: WHO CAN I PROTECT...?

source: 과
en_us: BANG

source: 밧
en_us: BOOM

source: 시간이 모자라...!
en_us: THAT’S NOT ENOUGH TIME...!

source: 잇짜시익-!!!
en_us: YOU SON OF A BITCH!!!

source: 콰 직
en_us: SMACK

source: 도와주겠나.
en_us: WILL YOU HELP ME?

source: 슈{j}우{j}욱
en_us: WOOSH{j}{j}

source: 말도 안 돼...!!
en_us: IT CAN’T BE...!!

source: 그들이 지구로 올겁니다
en_us: THEY ARE COMING TO EARTH.

source: 이 녀석은 내가 맡을테니,
en_us: I’LL TAKE THIS GUY,

source: 보안 요원들은 나가 있어 주겠나.
en_us: GO OUTSIDE, GUARDS.

source: 지지직
en_us: PZZZT

source: 잠깐 쉬어야 겠어...
en_us: I’LL REST FOR A BIT...

source: [캣슈트] 라는 것이 아니었다면 죽었을지도 몰라요.
en_us: WITHOUT THAT CATSUIT, YOU COULD HAVE DIED.

source: 쉽게 말하자면 물체를 역으로 텔레포트 시키는 장치.
en_us: PUT SIMPLY, THE DEVICE TELEPORTS OBJECTS THE OTHER WAY.

source: 잘 받아갈게.
en_us: ...I’LL TAKE THEM FROM HERE.

source: 우리 집 고양이야...
en_us: MY HOUSE CAT...

source: 쿠웅
en_us: BOOM

source: 피햇-!!
en_us: WATCH OUT!!

source: 우주 최강의 생명체가 된다...!
en_us: ...HE WILL BECOME THE MOST POWERFUL CREATURE IN THE UNIVERSE...!

source: 슈트의 힘을 자신의 힘으로 착각하고
en_us: SOME MISTOOK THEIR SUITS’ POWER AS THEIR OWN...

source: 바{j}밧
en_us: TADADA{j}

source: 개죽음 당하려고!?
en_us: ARE YOU TRYING TO GET YOURSELF KILLED?!

source: 그렇게 녀석들이랑 함께 하고 싶어!?
en_us: YOU REALLY WANNA JOIN THEM?!

source: 아
en_us: ;ASLKVDNA

source: 디비님!!
en_us: MASTER DB!!

source: 난...
en_us: I...

source: 그들과 다른 뜻을 가진 냥인들이 선별한 인간 전투 요원들.
en_us: ...FIGHTING AGAINST OTHER CAT PEOPLE WHO TRIED TO TAKE OVER THE PLANET.

source: 냐아아앙!!
en_us: MEOOOW!!

source: 이런게 뭐가 좋다고 피려고 하냐.
en_us: WHAT’S SO GOOD ABOUT THIS THAT YOU WANT IT TOO?

source: 낼름
en_us: LICK

source: 오빠가 지킬 수 있겠어?
en_us: LOOK AFTER MOM?

source: - 인간 모집 -
en_us: - HUMAN RECRUITMENT -

source: 못 보던 학생인데...
en_us: I’VE NEVER SEEN YOU BEFORE...

source: 스 윽
en_us: SWOOP

source: 한 곳에 집중을 할 때 반대 쪽의 경계가 흐려졌었어...!!
en_us: ...WHEN SHE FOCUSED ON ONE SPOT, SHE LOWERED HER GUARD ON THE OPPOSITE SIDE...!

source: 뭐냐고...!!
en_us: WHAT IS HAPPENING...?!

source: 계속
en_us: TO BE CONTINUED

source: 용서 못 해...!!
en_us: I’LL NEVER FORGIVE YOU...!!

source: 스윽
en_us: WHISH

source: 캣슈트와...롱캣의...
en_us: OF THE CAT SUIT... AND LONG CAT...

source: 띠링
en_us: RING RING

source: 부럽다...
en_us: I’M JEALOUS...

source: 네로님 처럼 특급전사가 되어서 냥잼을 이식받고 싶거든요.
en_us: I WANT TO BECOME A SPECIALIZED WARRIOR AND RECEIVE A MEOW GEM TRANSPLANT LIKE YOU, MASTER NERO.

source: 유리 밖으로는 염동력이 닿질 않아...!!
en_us: MY POWERS WON’T GET THROUGH...!!

source: 괜찮아!
en_us: IT’S OKAY!

source: ...흠.
en_us: HMM...

source: 으음...
en_us: UGH...

source: 타닷
en_us: TAP TAP

source: 로봇이 이기고 있어!
en_us: THE ROBOT’S WINNING!

source: 거기 환자분!!
en_us: YOU THERE!!

source: 나에게 냥잼을 넘기는 것이
en_us: HANDING THE MEOW GEM OVER TO ME...

source: 놀고 있군...!!
en_us: STOP MESSING AROUND...!!

source: 뭐...
en_us: WHAT...

source: 꽈{j}앙
en_us: THUNK{j}

source: [어둠]과 하나가 되는 것-
en_us: BECOMING ONE WITH THE DARKNESS...

source: 뚫진 못했지만...
en_us: I COULDN’T BLAST THROUGH HIM, BUT...

source: 그딴 하찮은 이유로 내가 집사레인저가 된 거라고
en_us: THAT’S THE ONLY REASON WHY I BECAME A MEOW RANGER?

source: 나 아직 안 끝 났다고...!
en_us: I TOLD YOU I’M NOT DONE WITH YOU YET...!

source: 응...!?
en_us: WHAT...?!

source: 이 지긋지긋한 싸움을...!!
en_us: IT’S TIME TO END...

source: 기뻐하십시오.
en_us: PLEASE CHEER UP.

source: 아 이혜민 개웃겨ㅋㅋㅋㅋㅋ
en_us: HYEMIN, YOU’RE HILARIOUS, HAHAHAHAHA!

source: 손을 잡자고 했지?
en_us: SO, YOU WANT TO WORK TOGETHER?

source: 쿠 웅
en_us: THUNK

source: 요즘은 기운도 넘치고...
en_us: LATELY I’VE FELT STRONGER...

source: 세호.
en_us: SEHO.

source: 못난 냥인을 따르게 해서 미안하다...
en_us: I’M SORRY FOR MAKING YOU SERVE AN INADEQUATE LEADER...

source: (이하 생략)
en_us: (OMITTED)

source: 아직 마음의 준비가 안 됐단 말이야...!
en_us: NOT READY FOR THIS YET...!

source: 네로가 도망쳤어...!!
en_us: NERO RAN AWAY...!!

source: 파{j}앗
en_us: WHOOSH{j}

source: 구구구
en_us: RUMBLE

source: 더 이상 네로를 상처입히지 마라.
en_us: LEAVE NERO ALONE.

source: 아직 버틴단 말이야?!
en_us: HE’S STILL HANGING ON?!

source: 저릿
en_us: TREMBLE

source: 냥잼 잔여 에너지가 몸에 남아있습니다.
en_us: YOUR BODY STILL CONTAINS RESIDUAL ENERGY FROM THE MEOW GEM.

source: 당신...!?
en_us: WHO THE HELL ARE YOU...?!

source: 바
en_us: POW

source: 원하는 대로 할테니...
en_us: I’LL DO AS YOU SAY...

source: 쿨..
en_us: ZZZ

source: 한주먹거리가 놀고 있네.
en_us: TOUGH GUY CAN’T EVEN TAKE ONE PUNCH.

source: 선생님...
en_us: DOCTOR...

source: 캣슈트로도 치유할 수 없는 치명상이더군.
en_us: IS FATAL. EVEN THE CAT SUIT CAN’T TREAT IT.

source: 난 그냥 평범한...
en_us: I’M JUST AN ORDINARY...

source: 저 한심한 표정은...!!
en_us: SHE LOOKS SO PATHETIC...!!

source: 우 웅
en_us: VWOOM

source: 간질
en_us: TREMOR

source: 시끌
en_us: BUSTLE

source: 쿠{j}구{j}구..{j}구{j}구{j}구
en_us: RUMBLE{j}{j}{j}{j}{j}

source: 여기서...
en_us: YOU’RE STAYING HERE...

source: 고집까지 센 분은 아니셨군요.
en_us: THANK GOODNESS YOU’RE NOT STUBBORN.

source: 오...오빠!!
en_us: H-HYEONMIN!

source: 파박
en_us: THWACK

source: 충성심이 대단한 걸요...?
en_us: HOW INCREDIBLY LOYAL...

source: 네로님께 나눠받은 힘이 익숙지 않아서
en_us: I’M NOT USED TO THE POWER NERO GAVE ME

source: 같은 레인저 였다고 친한 척 하지마.
en_us: ...DON’T ACT LIKE WE’RE FRIENDS BECAUSE WE WERE BOTH RANGERS ONCE.

source: 아무나 못 하는 거야 그런 건...
en_us: NOT JUST ANYONE CAN DO THAT...

source: 도움 / 김용희
en_us: ASSISTANCE: YONGHUI KIM

source: 어이, 샴!!
en_us: YO, SIAMESE!!

source: 아련...
en_us: WISTFUL

source: 철컥
en_us: KACHUNK

source: 촤르륵
en_us: CLICK CLICK

source: 기억난다.
en_us: I REMEMBER.

source: 머슬...!
en_us: MUSCLE...!

source: 생각나는 녀석이 있습니다.
en_us: I CAN THINK OF ONE PERSON.

source: 으아으아아아!!
en_us: AAAAAGH!!

source: 너...너가 가서 어쩌라고!!
en_us: WH-WHAT ARE YOU GONNA DO?!

source: 하여간 네로님...
en_us: SHEESH, MASTER NERO...

source: 저 모습은...!?
en_us: BUT HE’S...?!

source: 끄으윽....!!
en_us: URGH...!!

source: 치 이 익...
en_us: SIZZLE

source: 어이 왕무식-!!
en_us: OYE, MORON!!

source: 비틀
en_us: WOBBLE

source: 이이잇!!
en_us: GYAAA!!

source: "위험해질까 봐" 라고...?
en_us: YOU WERE SAYING YOU “WANTED TO PROTECT ME...?”

source: - 새로운 씨몽키 -
en_us: - A NEW C-MONKEY -

source: 말하고 있는데 공격을...!
en_us: HE ATTACKED ME WHILE I WAS TALKING...!

source: 오옷-!?
en_us: WHAAA?!

source: 휙
en_us: FLICK

source: 쿠{j}구{j}구{j}궁
en_us: RUMBLE{j}{j}{j}

source: 쿠 구{j}구{j}구{j}구{j}구
en_us: RUMBLE{j}{j}{j}{j}

source: 에잇
en_us: HYAA

source: 타 다 닥
en_us: TAP TAP TAP

source: 감히 그녀를~ ♪
en_us: DARE TO~ ♪

source: 네 녀석!!
en_us: YOU ASSHOLE!!

source: 살려주세요오옷!!!
en_us: PLEASE HAVE MERCY ON MEEE!!!

source: 반 짝
en_us: TWINKLE

source: 저건 또 뭐야!!
en_us: WHAT ON EARTH IS THAT?!

source: 이 모든게 우주선이 나타난지 단 2주만에 일어난 일.
en_us: ALL OF THIS HAPPENED WITHIN A MERE TWO WEEKS AFTER THE SPACESHIP’S APPEARANCE.

source: 어...
en_us: Oh...

source: 응...?
en_us: HUH...?

source: 우와악!
en_us: AAAGH!

source: 턱시도들도 사라졌어...!!
en_us: ALL OF THE TUXEDO CATS ARE GONE TOO...!!

source: 고 오 오 오
en_us: GWAAAA

source: 이거나 풀고 말하시지...!!
en_us: RELEASE ME FIRST...!!

source: 핵미사일 발사.
en_us: LAUNCH THE NUCLEAR MISSILE.

source: 서...서...
en_us: I-IS IT...

source: 그쪽도 소용없어!!
en_us: BUT IT’S USELESS!!

source: 퍽
en_us: THUMP

source: 거대 고양이가 날뛰고 있다구!!
en_us: A GIANT CAT IS ON THE LOOSE!

source: 앗!!
en_us: GASP

source: 이혜민...
en_us: HYEMIN...

source: ㅋㅋㅋㅋㅋㅋㅋㅋ
en_us: HAHAHAHAHAHAHAHA!

source: 그래.
en_us: YEAH,

source: 발톱 강홧-!!
en_us: CLAW POWER UP!!

source: 우리 연구진들은 신 씨몽키를 움직일 새로운 동력원을 찾다가...
en_us: US RESEARCHERS LOOKED FOR NEW RESOURCES TO CONTROL NEW C-MONKEYS...

source: 하지만,
en_us: ONLY,

source: 그래...
en_us: THAT’S RIGHT...

source: 만약의 사태를 대비해 나와 호열아저씨는 계속 활동을 했었어.
en_us: ...BUT AS A PRECAUTION, MR. HOYEOL AND I REMAINED ACTIVE.

source: ...아저씨...!!
en_us: MR. HOYEOL...!!

source: ㅋㅋㅋ
en_us: HAHAHA

source: 뭉게
en_us: PUFF

source: 이현민 XXㅅㄲ...
en_us: HYEONMIN, YOU BASTARD...

source: 해치웠나!?
en_us: DID THEY GET HIM?!

source: 오빠가 알게되면...
en_us: IF HYEONMIN FINDS OUT...

source: 그거 해봐.
en_us: DO IT.

source: 오늘 네로님이 포기하신 건 냥잼이 아닙니다.
en_us: WHAT YOU GAVE UP TODAY WAS NOT THE MEOW GEMS, MASTER NERO...

source: 현실안주형 /
en_us: STORY/ART: AHNJOO

source: 출동-!!
en_us: MOBILIZE!!

source: - 악당의 사정 (2) -
en_us: - THE VILLAIN’S MOTIVES - (2)

source: 롱캣 압수.
en_us: LONG CAT RETRIEVED.

source: 움찔
en_us: TWITCH

source: 삐
en_us: BEEP

source: 위 잉
en_us: BZZT

source: 이방의 인간들을 전부 죽여버린 뒤, 다시 말해주마.
en_us: I WILL SLAUGHTER THIS ENTIRE CLASS BEFORE I TELL YOU AGAIN.

source: 헛수고다.
en_us: IT’S USELESS.

source: 저벅
en_us: STEP

source: 파
en_us: POW

source: 고통받는 냥인들을 해방하기 위해서...!
en_us: TO FREE THE CAT PEOPLE THAT ARE SUFFERING...!

source: 뭐가 어떻게 된 거야 총각?
en_us: WHAT IS GOING ON, YOUNG MAN?

source: 젠장!
en_us: DAMN IT!

source: 콕
en_us: JAB

source: 냥인이 어디까지 강력해질 수 있는지 궁금하지 않나?
en_us: AREN’T YOU CURIOUS TO KNOW HOW POWERFUL CAT PEOPLE CAN BECOME?

source: 세뇌파 증폭-
en_us: AMPLIFYING BRAINWASHING WAVE.

source: 현재 지구에 있는 냥인의 수가...
en_us: THE POPULATION OF CAT PEOPLE CURRENTLY ON EARTH...

source: 네로님을 따르던 저희들을 배신하는 겁니다!!
en_us: WHAT YOU’RE DOING IS BETRAYING US, YOUR FOLLOWERS!!

source: 쿵
en_us: CRACK

source: 하아앗-!!
en_us: HIYAAA!!

source: 엄...{j}엄ㅁ..
en_us: M-MOM...{j}

source: 칫-,
en_us: TSK.

source: 말해라...
en_us: TELL ME...

source: 버{j}럭{j}럭
en_us: SCREAM{j}{j}

source: 힘이 바닥나기 전에 끝내주마...!
en_us: BETTER END IT BEFORE I LOSE MY STRENGTH...!

source: 어?
en_us: HUH?

source: 갑자기 이런 일에 휘말리게 해서...
en_us: I DRAGGED YOU INTO THIS...

source: 잔머리 굴리는 소리가 여기까지 들리는 군.
en_us: I CAN HEAR YOU WEIGHING YOUR OPTIONS.

source: 번뜩..
en_us: BLINK...

source: 항상 사람들 뒤에 숨어 도망치키나 하고...!!
en_us: I’VE ALWAYS BEEN HIDING BEHIND OTHERS AND RUNNING AWAY...!!

source: 내 모든 걸 쏟아부은 한방으로 마무리 지어주마!!
en_us: I’M GONNA END THIS IN ONE SHOT WITH EVERYTHING I’VE GOT!!

source: 수상해.
en_us: IT’S VERY SUSPICIOUS.

source: 이런 괴물자식....!!
en_us: THIS GUY’S A MONSTER...!!

source: 사...상처 역시 빠르게 회복 될거라는 건 알았지만...
en_us: I KNEW THAT YOUR INJURIES WOULD HEAL QUICKER THAN USUAL, BUT...

source: 멈칫...
en_us: FREEZE

source: 쓰러진다앗-!!!
en_us: IT’S FALLING OVER!!!

source: 저 녀석을 에워싸 집사리인저-!!
en_us: HE’S SURROUNDED BY MEOW RANGERS!!

source: 죄송해요...!
en_us: I’M SORRY...

source: 한번만 더 네로의 심기를 건드리면 죽여버리겠어.
en_us: INSULT HER AGAIN AND I’LL KILL YOU.

source: 거...거기섯-!!
en_us: H-HOLD IT RIGHT THERE!!

source: 형이야 이것들아.
en_us: JUST CALL ME BRO.

source: 쿠 웅-
en_us: THUD

source: 인공지능이 허가 되지 않은 공격을 감지해 보호막을 생성하거나...
en_us: THE ARTIFICIAL INTELLIGENCE DETECTS UNANTICIPATED ATTACKS AND GENERATES A SHIELD TO BLOCK THEM.

source: 뭐...!!{j}뭐야 저게!!
en_us: WH-WHAT IS THAT...?!{j}

source: 그만둬!!
en_us: ENOUGH!!

source: [아담]이다.
en_us: YOU ARE ADAM.

source: 자기도 맞을 걸 알면서 싸워줬다는 거.
en_us: AND FOUGHT BACK AT THE COST OF BEING HIT TOO...

source: 냥행성에서 지구로 온 냥인 수의 몇 배입니다.
en_us: OUTNUMBER THE CAT PEOPLE COMING TO EARTH A FEW TIMES OVER.

source: 적당히 알아서 생각해.
en_us: JUST ACCEPT IT.

source: 동족을 미끼로 삼은 거냐...?!
en_us: ...USE YOUR OWN KIND AS BAIT...?!

source: 곧 피바람이 불거다.
en_us: ...BUT SOON, IT’S GONNA BE A BLOODBATH.

source: 고 오오오
en_us: GWAAA

source: 사놓은 캣닢을 다 맛보려면 시간이 부족해!!
en_us: I DON’T HAVE ENOUGH TIME TO TRY ALL THE CATNIP I BOUGHT!!

source: 겁나 웃기네.
en_us: THAT’S HILARIOUS.

source: 젠장...
en_us: CRAP...

source: 발사.
en_us: FIRE.

source: 화{j}악
en_us: WHOOSH{j}

source: 소년.
en_us: YOU.

source: 모...{j}모르겠어..!
en_us: I-I DON’T KNOW...!{j}

source: - 전쟁터 (11) -
en_us: - BATTLEFIELD (11) -

source: 정신차려!!
en_us: WAKE UP!!

source: 집사레인저.
en_us: ...MEOW RANGER.

source: 웬 고양이들이..!
en_us: WHERE DID ALL THESE CATS COME FROM...?!

source: 슈{j}욱
en_us: WHOOSH{j}

source: ...모두를...
en_us: ...YOUR ENTIRE FAMILY...

source: 느낄 수도 없어.
en_us: NOR FEEL ME.

source: 우다다
en_us: DASH

source: 오오!!
en_us: OOH!!

source: 쿠 당 탕
en_us: TUMBLE

source: 100% 그거야...!
en_us: THIS IS 100% IT...!

source: 엄마 비켜!!
en_us: MOM, MOVE!!

source: 네가 못 지켰다고 자책하지마.
en_us: FOR NOT BEING ABLE TO SAVE MINSIK AND MR. HOYEOL...

source: 호열 아저씨와 오빠를 위험하게 만든 최강자...!!
en_us: ...IS THE STRONGEST BEING WHO PUT MR. HOYEOL AND HYEONMIN IN DANGER...!!

source: 와{j}르{j}르
en_us: WHOOSH{j}{j}

source: 이쁘다...!
en_us: SHE’S PRETTY...!

source: 감히 왕자님께 적의를...!!
en_us: HOW DARE YOU INSULT THE PRINCE...!

source: 척
en_us: POINT

source: 스륵
en_us: FLICK

source: 울먹
en_us: TEARY

source: 냥잼이 두 개라니.
en_us: TWO MEOW GEMS.

source: 크윽...
en_us: AGH...

source: 질끈
en_us: GRIT

source: 쉬는 시간 얼마 안 남았잖아~
en_us: BUT BREAK TIME IS ALMOST OVER--

source: 낄낄낄!
en_us: HAHAHA!

source: 구{j}구{j}구
en_us: SWOOSH

source: 고맙네...
en_us: THANK YOU...

source: 자, 간다앗!!!
en_us: ALL RIGHT, HERE IT COMES!!!

source: 최첨단 경비 시스템 부터 각종 편의 시설까지 준비 되어 있고...
en_us: WE’VE PREPARED EVERYTHING, FROM HIGH-TECH SECURITY SYSTEMS TO VARIOUS AMENITIES...

source: 그렇습니다.
en_us: YES.

source: 두 분도 지구 출신 냥인이시지요?
en_us: BOTH OF YOU ARE ALSO FROM EARTH, RIGHT?

source: 끄어억
en_us: UGH

source: 현실안주형 / h.a_ahnjoo
en_us: STORY/ART: AHNJOO

source: 내 냥잼을 내놓으라는 거냐...
en_us: ARE YOU TELLING ME TO GIVE YOU MY MEOW GEM...?

source: 내가 그 때 일...
en_us: HAVE I EVER...

source: 광
en_us: SLAM

source: 컥
en_us: ;ALKFD

source: 하늘에 떠있는 우주선을 쫓아 내고 싶지 않나?
en_us: DON’T YOU WANT TO CHASE AWAY THE SPACESHIP IN THE SKY?

source: 파 앗
en_us: LUNGE

source: 뭐야 이거!!
en_us: WHAT THE HELL IS THIS!!

source: 발목 잡을 줄 알았다니까.
en_us: I KNEW THEY WOULD HOLD US BACK.

source: 과 광
en_us: SLAM BANG

source: 을 날리고 싶지만,
en_us: ...IS WHAT I WOULD LIKE TO DO...

source: 네로...!!
en_us: NERO...!!

source: 마구잡이 공격이 아닌 최소의 힘으로 녀석을 잡아야 해.
en_us: I CAN’T ATTACK HIM RECKLESSLY. I HAVE TO GET HIM USING AS LITTLE POWER AS POSSIBLE.

source: 결국 다시 흙뿌리기 공격이냐!!
en_us: ARE YOU BACK TO THROWING DIRT AGAIN?!

source: 네로님!!
en_us: MASTER NERO!!

source: 현재는 영혼 상태.
en_us: NOW A SPIRIT.

source: 하지만...
en_us: BUT...

source: 도망쳐!!!
en_us: RUN!!!

source: 인간&지구출신 냥인
en_us: HUMANS & CAT PEOPLE OF EARTH

source: 콰 드 득
en_us: SCRAPE

source: Full charging
en_us: Fully charged

source: 득
en_us: BLE

source: 쿨럭-
en_us: COUGH

source: 방금 전까지만 해도 교실의 사람들을 인질삼아서 협박해놓고...!
en_us: YOU JUST TOOK MY CLASSMATES HOSTAGE AND THREATENED US...!

source: 임시로 세계 대통력직을 맡고 나서...
en_us: I ASSUMED THE INTERIM WORLD PRESIDENCY...

source: 쩍
en_us: CRACKLE

source: J-94 실험체, 직접 보고 싶군.
en_us: I’D LIKE TO SEE SUBJECT J-94 UP CLOSE.

source: 도움 / 백주원 이명훈
en_us: ASSISTANCE: JUWON BAEK, MYEONGHUN LEE

source: 찍어 누를 필요도 없이...
en_us: ...I COULD’VE KILLED YOU IN AN INSTANT...

source: 박
en_us: THWACK

source: 슈{j}우욱
en_us: WHOOSH{j}

source: 대체...!!
en_us: WHAT IN THE WORLD...

source: 이곳을 벗어나야 해!
en_us: I’VE GOTTA GET OUT OF HERE!

source: 뭐...!!{j}뭐야 이거!!
en_us: WH-WHAT THE HELL IS THIS?!

source: 어쩔 수 없군.
en_us: WHATEVER YOU SAY.

source: 핫...
en_us: EEP...

source: 냥인을 신으로 모시는 새로운 노예.
en_us: THESE NEW SLAVES WILL REVERE CAT PEOPLE AS GODS.

source: ...나는 게...
en_us: WITH LIGHT...

source: 일부러 공격을 예고해서 시간차 공격을...!!
en_us: YOU WARN ME FIRST AND THEN TRY A DELAYED ATTACK...?!

source: 지금 그런 거 따질 때야!?
en_us: THIS ISN’T THE TIME FOR THAT!

source: 아~
en_us: HA.

source: 싸움이 끝나면 말해준다고 했었지.
en_us: I MENTIONED I’D TELL YOU ABOUT THE MEOW RANGERS...

source: 으아아아아!!!
en_us: AAAGH!!!

source: 무슨 싸움을 하고 있는 거야?!
en_us: HOW’S HE FIGHTING OVER THERE?!

source: 말해줄 때인 것 같다.
en_us: ...WHY YOU BECAME A MEOW RANGER.

source: 네로님을 막을 자가 없었던건 오늘 역시 마찬가지였지요.
en_us: ...THERE WAS NO ONE STOPPING YOU ON THE BATTLEFIELD TODAY.

source: 걱정마.
en_us: DON’T WORRY.

source: 맞고 온 오빠의 복수를 해주겠다고...
en_us: FEARLESSLY ATTACKED THE 6TH GRADE BOYS...

source: 나의 털은 검은 색.
en_us: MY HAIR IS BLACK.

source: 깜돌이가 너만 보면 나약해진단 말야...
en_us: SHADOW ONLY GETS WEAK WHEN HE SEES YOU...

source: 녀석을 제어실까지 안내할 전투냥인이 필요해...
en_us: WE NEED A WARRIOR CAT TO LEAD HIM TO THE CONTROL ROOM...

source: 버{j}럭
en_us: SCREAM{j}

source: 고 오{j}오
en_us: WHOOSH{j}

source: 네로와 같은 편이 아니야...?
en_us: IS HE NOT ON NERO’S SIDE...?

source: 이것들을 남기고 네로만 떠난 건...
en_us: NERO TOOK OFF, LEAVING THIS BEHIND...

source: 힘이 빠지고 있어...!!
en_us: I’M LOSING STRENGTH...!!

source: 네 부하들의 목숨은 내 손에 달려있으니까.
en_us: YOUR LACKEYS’ LIVES ARE IN MY HANDS, YOU SEE.

source: 이 싸움은 네 녀석 따위가 끼어들 곳이 아니야.
en_us: THIS FIGHT HAS NO PLACE FOR THE LIKES OF YOU.

source: 두리번
en_us: TURN

source: 다
en_us: DASH

source: 안돼...!!
en_us: NO...!!

source: 으아악!!
en_us: AAAGH!!

source: 쫓아가서 포를 만들어 주...
en_us: I’LL CHASE HIM DOWN AND GRIND HIM INTO...

source: 콰앙
en_us: SLAM

source: 진짜 뭐냐고...
en_us: WHAT IS THAT...?

source: 아{j}...
en_us: ZZZZ{j}

source: 너희 냥인들에게 이 몸은 악몽 그 자체...
en_us: I AM YOU CAT PEOPLE’S WORST NIGHTMARE...

source: 말해줄게.
en_us: WHY I BECAME A MEOW RANGER.

source: 꾸 욱
en_us: CLENCH

source: 힘들어...
en_us: I’M TIRED...

source: 쿠{j}구{j}구..{j}
en_us: RUMBLE{j}{j}{j}

source: 안 그러면
en_us: IF YOU DON’T...

source: 나 처럼 살면 안된다.{j}너희들.
en_us: AND DON’T LIVE LIKE ME.{j}

source: 멍청한 인간녀석...!!
en_us: YOU FOOLISH HUMAN...!!

source: 냥젤리 어택...!
en_us: CAT TOE BEANS ATTACK...!

source: 그렇다고 해서...
en_us: EVEN SO...

source: 저런 바위에 깔리면...!
en_us: IF THAT BOULDER CRUSHES ME...

source: 지금 이 세상...
en_us: THE WORLD NOW...

source: 디비님의 신체 활동이 빨라진 만큼...
en_us: AS YOUR PHYSICAL PROCESSES SPEED UP...

source: 오.
en_us: OH.

source: 슈우욱
en_us: WHOOSH

source: 그래서, 어떡할 거지?
en_us: SO, WHAT’S THE PLAN?

source: 피식
en_us: CHUCKLE

source: 끄덕
en_us: NOD

source: 찾았다.
en_us: FOUND YOU.

source: 하아...
en_us: AHH...

source: 늦지 않게 마음을 정해라.
en_us: DECIDE, BEFORE IT’S TOO LATE.

source: 태미!!
en_us: TEMI!!

source: 앙
en_us: PZZT

source: 위험해!{j}이녀석!
en_us: THIS BASTARD IS DANGEROUS!{j}

source: 우 다 다 다
en_us: DASH

source: 내 집사는 죽이지 않는다.
en_us: I’M NOT KILLING MY BUTLER.

source: 오싹
en_us: SHUDDER

source: 쓸데 없는 곳에 힘을 낭비했어...!
en_us: I ENDED UP WASTING MY ENERGY FOR NO REASON...!

source: 아{j}아
en_us: RUMBLE{j}

source: 제...{j}제엔장...!!
en_us: D-DAMN IT...!!{j}

source: 욱
en_us: SH

source: 부들
en_us: SHAKE

source: 우리는 예외로 둘 생각이냐...!?
en_us: ARE YOU PLANNING TO MAKE AN EXCEPTION FOR US...?!

source: 졸려...
en_us: I’M SO SLEEPY...

source: 지금의 나는 거대한 롱캣과 융합한 상태.
en_us: I’M NOW FUSED WITH GIANT LONG CAT.

source: 씨몽키들의 본능 속에 냥인을 향한 애정,사랑을 심었습니다.
en_us: PLANTED LOVE AND AFFECTION TOWARD CAT PEOPLE INTO THE INSTINCTS OF C-MONKEYS.

source: 사라져야 된다는 걸...
en_us: ...MUST BE DESTROYED...

source: 보인다!!
en_us: I SEE IT!!

source: 너무 비겁하잖아 이건...!!
en_us: THIS IS SO UNDERHANDED...!!

source: 끄으으...
en_us: GRRR

source: ...제길...!
en_us: DAMN IT...!

source: 오빠..!
en_us: HYEONMIN...!

source: 꽈아악
en_us: SQUEEZE

source: 비틀..
en_us: WOBBLE

source: 알리든 말든 상관없어.
en_us: I DON’T CARE IF HE FINDS OUT.

source: 멋있어!!
en_us: AMAZING!!

source: 다른 턱시도랑은 뭔가 달라...!!
en_us: HE’S NOT LIKE THE OTHER TUXEDO CATS...!!

source: 무리해서 서두르시는 거 아닙니까!?
en_us: TO GET A MEOW GEM TRANSPLANT BEFORE YOUR GROWTH PHASE RUNS OUT?!

source: 집사...레인저...?
en_us: ARE YOU... A MEOW RANGER...?

source: 냥잼을 이용한...
en_us: A FUSION...

source: 싸움이 길어지면 안 되겠어...!!
en_us: WE CAN’T DRAG THE FIGHT ANY LONGER...!!

source: 도저히 납득이...
en_us: I JUST CAN’T UNDERSTAND...

source: 온전한 [불로불사]...
en_us: BUT FOUNTAIN OF YOUTH TOO...

source: 수컷의 각오를 우습게 만들지 말아줄래.
en_us: DON’T MAKE LIGHT OF A MAN’S RESOLVE.

source: ...그의 육체는 냥인화 되고 있지.
en_us: HE BODY IS CAT PERSONIFYING.

source: ...말은 안 했었지만 고마웠어.
en_us: I NEVER SAID SO BUT... I APPRECIATED IT.

source: 혼자있는 것 같아...!!
en_us: IT’S LIKE I’M ALL ALONE HERE...!
